In [1]:
# import Pandas as pd
import pandas as pd

In [2]:
# create a new data frame
df = pd.DataFrame({'Name': ['Rishi Arora', 'Ajit Nanda', 'Deepak Chaudary'],
                   'Age':[32, 34, 36]})
df

              Name  Age
0      Rishi Arora   32
1       Ajit Nanda   34
2  Deepak Chaudary   36

In [3]:
df['Name'].str.split()

0        [Rishi, Arora]
1         [Ajit, Nanda]
2    [Deepak, Chaudary]
Name: Name, dtype: object

In [4]:
df[['First','Last']] = df.Name.str.split(" ",expand=True,)
df

              Name  Age   First      Last
0      Rishi Arora   32   Rishi     Arora
1       Ajit Nanda   34    Ajit     Nanda
2  Deepak Chaudary   36  Deepak  Chaudary

In [5]:
# create a new data frame
movies = pd.DataFrame({'Movie': ['Toy Story','Jumanji','Grumpier Old Men','Waiting to Exhale','Father of the Bride Part II'],
                       'Genre': ['Animation|Children|Comedy' ,'Adventure|Children|Fantasy' ,'Romance|Comedy' ,'Comedy|Drama' ,'Comedy'],
                       'Released in Year':['1995','1995','1995','1995','1995']})
movies

                         Movie                       Genre Released in Year
0                    Toy Story   Animation|Children|Comedy             1995
1                      Jumanji  Adventure|Children|Fantasy             1995
2             Grumpier Old Men              Romance|Comedy             1995
3            Waiting to Exhale                Comedy|Drama             1995
4  Father of the Bride Part II                      Comedy             1995

In [6]:
moviesGenres = movies['Genre'].str.split("|",expand=True).rename(columns = lambda x: "Genres"+str(x+1))

In [7]:
moviesGenres

     Genres1   Genres2  Genres3
0  Animation  Children   Comedy
1  Adventure  Children  Fantasy
2    Romance    Comedy     None
3     Comedy     Drama     None
4     Comedy      None     None

In [8]:
movies.join(moviesGenres)

,Movie,Genre,Released in Year,Genres1,Genres2,Genres3
0,Toy Story,Animation|Children|Comedy,1995,Animation,Children,Comedy
1,Jumanji,Adventure|Children|Fantasy,1995,Adventure,Children,Fantasy
2,Grumpier Old Men,Romance|Comedy,1995,Romance,Comedy,None
3,Waiting to Exhale,Comedy|Drama,1995,Comedy,Drama,None
4,Father of the Bride Part II,Comedy,1995,Comedy,None,None

Ref : https://apassionatechie.wordpress.com/2018/02/24/how-do-i-split-a-string-into-several-columns-in-a-dataframe-with-pandas-python/
https://cmdlinetips.com/2018/11/how-to-split-a-text-column-in-pandas/